[
    {"text": "North Korean leader Kim Jong-un has vowed to build a powerful military to strengthen war deterrence, but insisted that the country’s main enemy is “war itself,” and not South Korea or the US. Kim made the remarks Monday as he gave a rare speech at a defense development exhibition to mark the previous day’s 76th founding anniversary of the ruling Workers’ Party, the North’s official Korea Central News Agency said Tuesday. It was the first time the North held such an exhibition, according to the Unification Ministry here, which displayed a variety of weapons the country developed in the last five years, including its Hwasong-16 intercontinental ballistic missile and the Hwasong-8 hypersonic missile it debuted last month. “We are not discussing war with anyone, but rather to prevent war itself and to increase war deterrence for the protection of national sovereignty,” Kim said “Our main enemy is the war itself, and not a certain country or forces like South Korea or the US.” He stressed that the North’s peace efforts did not in any way mean giving up its rights to self-defense, noting the military buildup is to cope with what he called “hostile forces” against Pyongyang.  Kim then accused the US of causing tension in the region with its “wrong judgments and actions,” calling it a “source” of instability on the Korean Peninsula. “For our descendants we need to be strong. We need to first be strong,” Kim said, stressing that a consistent buildup of its military is required in line with instability on the peninsula. He added that the military threats the North faced were different from what it saw 10, five or three years ago. Meanwhile, the North attacked South Korea for its “hypocrisy” and “double standards,” repeating earlier accusations. It took issue with the South condemning the North’s weapons development tests as “provocations” and “threats” while it builds up its own military capabilities, including purchases of high-tech weaponry from the US. “South Korea’s unrestricted and dangerous efforts to strengthen its military are destroying the military balance on the peninsula and increasing military instability and danger,” said Kim. But the leader still said South Korea was not the one the North’s military forces had to fight against and that its military buildup was not targeted at the South, stressing the “horrific history” of conflict among the same people should not be repeated on this land again.The Unification Ministry said it views Kim’s remark as repeating its earlier stance that the leader delivered last month at the parliament, criticizing Seoul’s military modernization and its “double-dealing attitude,” while demanding the US withdraw what it calls a “hostile policy,” South Korea’s military said that the intelligence authorities of Seoul and Washington are currently analyzing weapons displayed at the exhibition. North Korea’s conflicting messages come as the regime continued with a flurry of missile tests last month -- its first weapons launches in six months. It tested a new cruise missile followed by two short-range ballistic missiles on Sept. 15 in defiance of UN Security Council resolutions banning the North from developing or testing nuclear weapons or ballistic missiles. The North also tested a new “hypersonic” missile, followed by a new type of anti-aircraft missile. While the North has dismissed the US’ offer to resume dialogue through a series of messages, it expressed willingness to resume talks with South Korea. The move is seen as the North’s attempt to build up its nuclear deterrent while driving a wedge between Seoul and Washington. Experts also say the North’s mixed messages are aimed at pressing Seoul, which desires to improve inter-Korean ties, to take action in its favor, such as by convincing Washington to ease sanctions. Last week, the inter-Korean hotlines were restored, about two months after Pyongyang unilaterally cut off contact in August, raising cautious hopes of an inter-Korean rapprochement."}
]